spec/cassettes/Create_payment_on_successful_charge/creates_a_payment_associated_with_the_user.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_2b1BL5hHkMoDDW
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - ! '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.8.5
      Authorization:
      - Bearer S5eZcyLrHDQM43WCbPoM95iPY1AXu6mm
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - ! '{"bindings_version":"1.8.5","lang":"ruby","lang_version":"1.9.3 p194 (2012-04-20)","platform":"x86_64-darwin12.4.0","publisher":"stripe","uname":"Darwin
        Daniels-MacBook-Air.local 12.4.0 Darwin Kernel Version 12.4.0: Wed May  1
        17:57:12 PDT 2013; root:xnu-2050.24.15~1/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 18 Sep 2013 23:59:19 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1283'
      Connection:
      - keep-alive
      Cache-Control:
      - no-cache, no-store
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Max-Age:
      - '300'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: US-ASCII
      string: ! "{\n  \"id\": \"evt_2b1BL5hHkMoDDW\",\n  \"created\": 1379526852,\n
        \ \"livemode\": false,\n  \"type\": \"charge.succeeded\",\n  \"data\": {\n
        \   \"object\": {\n      \"id\": \"ch_2b1B6mUpw39bZK\",\n      \"object\":
        \"charge\",\n      \"created\": 1379526852,\n      \"livemode\": false,\n
        \     \"paid\": true,\n      \"amount\": 999,\n      \"currency\": \"usd\",\n
        \     \"refunded\": false,\n      \"card\": {\n        \"id\": \"card_2b1BaFzXyP3tah\",\n
        \       \"object\": \"card\",\n        \"last4\": \"4242\",\n        \"type\":
        \"Visa\",\n        \"exp_month\": 9,\n        \"exp_year\": 2013,\n        \"fingerprint\":
        \"QmBJuLviOP1VUjZt\",\n        \"customer\": \"cus_2b1BGwu2rrrkkT\",\n        \"country\":
        \"US\",\n        \"address_city\": null,\n        \"cvc_check\": \"pass\"\n
        \     },\n      \"captured\": true,\n      \"balance_transaction\": \"txn_2b1BTrwpTxCG0B\",\n
        \     \"failure_code\": null,\n      \"customer\": \"cus_2b1BGwu2rrrkkT\",\n
        \     \"invoice\": \"in_2b1BsIgyrVVSue\",\n      \"dispute\": null,\n      \"fee\":
        59,\n      \"fee_details\": [\n        {\n          \"amount\": 59,\n          \"currency\":
        \"usd\",\n          \"type\": \"stripe_fee\",\n          \"description\":
        \"Stripe processing fees\",\n          \"application\": null,\n          \"amount_refunded\":
        0\n        }\n      ],\n      \"disputed\": false\n    }\n  },\n  \"object\":
        \"event\",\n  \"pending_webhooks\": 0,\n  \"request\": \"iar_2b1B8DkxLob4p5\"\n}\n"
    http_version: 
  recorded_at: Wed, 18 Sep 2013 23:59:19 GMT
recorded_with: VCR 2.5.0
